# SpotLightDistribution Constructor (SpotLightDistribution) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpotLightDistribution Constructor (SpotLightDistribution)
SpotLightDistribution Class See Also
---
Creates a copy of the given spotlight distribution
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public SpotLightDistribution(
	SpotLightDistribution other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As SpotLightDistribution _
)
```

Visual C++
---
```text
public:
SpotLightDistribution(
	SpotLightDistribution^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Lighting..::..SpotLightDistribution
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SpotLightDistribution Class
SpotLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace